## Staging: network
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 2 to add, 1 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |               NAME                |
|--------|-----------------------------------|
| add    | `aws_vpc_endpoint.logs`           |
|        | `aws_vpc_endpoint.rds`            |
| update | `aws_security_group.vpc_endpoint` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_security_group.vpc_endpoint will be updated in-place
  ~ resource "aws_security_group" "vpc_endpoint" {
        id                     = "sg-0b1324d2f9583723e"
        name                   = "vpc_endpoints"
      ~ tags                   = {
          ~ "Name"       = "vpc_endpoints\t" -> "saas_procurement_app_sg"
            # (2 unchanged elements hidden)
        }
      ~ tags_all               = {
          ~ "Name"       = "vpc_endpoints\t" -> "saas_procurement_app_sg"
            # (2 unchanged elements hidden)
        }
        # (7 unchanged attributes hidden)
    }

  # aws_vpc_endpoint.logs will be created
  + resource "aws_vpc_endpoint" "logs" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + ip_address_type       = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = true
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = [
          + "sg-0b1324d2f9583723e",
        ]
      + service_name          = "com.amazonaws.ca-central-1.logs"
      + state                 = (known after apply)
      + subnet_ids            = [
          + "subnet-061d1ba72b3063d92",
          + "subnet-08b6b67d74b37e07b",
          + "subnet-0d3a016c7742a6dab",
        ]
      + tags_all              = (known after apply)
      + vpc_endpoint_type     = "Interface"
      + vpc_id                = "vpc-04ac29c4ad6b4676e"

      + dns_options {
          + dns_record_ip_type = (known after apply)
        }
    }

  # aws_vpc_endpoint.rds will be created
  + resource "aws_vpc_endpoint" "rds" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + ip_address_type       = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = false
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = [
          + "sg-0b1324d2f9583723e",
        ]
      + service_name          = "com.amazonaws.ca-central-1.rds-data"
      + state                 = (known after apply)
      + subnet_ids            = [
          + "subnet-061d1ba72b3063d92",
          + "subnet-08b6b67d74b37e07b",
          + "subnet-0d3a016c7742a6dab",
        ]
      + tags_all              = (known after apply)
      + vpc_endpoint_type     = "Interface"
      + vpc_id                = "vpc-04ac29c4ad6b4676e"

      + dns_options {
          + dns_record_ip_type = (known after apply)
        }
    }

Plan: 2 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_security_group.app"]
WARN - plan.json - main - Missing Common Tags: ["aws_vpc_endpoint.logs"]
WARN - plan.json - main - Missing Common Tags: ["aws_vpc_endpoint.rds"]
WARN - plan.json - main - Missing Common Tags: ["aws_vpc_endpoint.s3"]

21 tests, 17 passed, 4 warnings, 0 failures, 0 exceptions

```

</details>
